Revit 2026 API

# TessellatedShapeBuilderCloseConnectedFaceSet Method

---

Closes the currently open connected face set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void CloseConnectedFaceSet()
```
```vb
Public Sub CloseConnectedFaceSet
```
```cpp
public:
void CloseConnectedFaceSet()
```
```fsharp
member CloseConnectedFaceSet : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | A face set is empty and cannot be closed until some faces are added. |

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace